Autodesk.Revit.DB.InSessionViewSheetSet.IsAutomatic
Automatic order or manual order.

Autodesk.Revit.DB.InSessionViewSheetSet.ViewOrganizationId
Autodesk.Revit.DB.ElementId to the Autodesk.Revit.DB.BrowserOrganization for non-sheet views.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the Autodesk.Revit.DB.ElementId does not reference to Autodesk.Revit.DB.BrowserOrganization, or the target type of Autodesk.Revit.DB.BrowserOrganization is incompatible.

Autodesk.Revit.DB.InSessionViewSheetSet.SheetOrganizationId
Autodesk.Revit.DB.ElementId to the Autodesk.Revit.DB.BrowserOrganization for sheets.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the Autodesk.Revit.DB.ElementId does not reference to Autodesk.Revit.DB.BrowserOrganization, or the target type of Autodesk.Revit.DB.BrowserOrganization is incompatible.

Autodesk.Revit.DB.InSessionViewSheetSet.OrderedViewList
Ordered views.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input ordered view list is null.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the set operation failed due to invalid view which cannot be printed.